{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.2.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_4",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 171, 300, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_4"
            },
            "name": "input_4",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [1, 3],
              "strides": [1, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.009999999776482582 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_3",
            "inbound_nodes": [[["input_4", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_3",
              "trainable": true,
              "dtype": "float32",
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_3",
            "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 150, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_5"
                  },
                  "name": "input_5",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_5",
                  "inbound_nodes": [[["input_5", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_5",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_5",
                  "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_4",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_4",
                  "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_6",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_6",
                  "inbound_nodes": [[["re_lu_4", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_6",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_6",
                  "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_5",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_5",
                  "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_7",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_7",
                  "inbound_nodes": [[["re_lu_5", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_7",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_7",
                  "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_4",
                  "inbound_nodes": [[["input_5", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_6",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_6",
                  "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_4",
                  "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout",
                  "inbound_nodes": [[["re_lu_6", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_4", 0, 0, {}],
                      ["dropout", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_5", 0, 0]],
              "output_layers": [["add", 0, 0]]
            },
            "name": "model",
            "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_1",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 75, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_6"
                  },
                  "name": "input_6",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_9",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_9",
                  "inbound_nodes": [[["input_6", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_9",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_9",
                  "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_7",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_7",
                  "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_10",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_10",
                  "inbound_nodes": [[["re_lu_7", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_10",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_10",
                  "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_8",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_8",
                  "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_11",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_11",
                  "inbound_nodes": [[["re_lu_8", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_11",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_11",
                  "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_8",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_8",
                  "inbound_nodes": [[["input_6", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_9",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_9",
                  "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_8",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_8",
                  "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout_1",
                  "inbound_nodes": [[["re_lu_9", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add_1",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_8", 0, 0, {}],
                      ["dropout_1", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_6", 0, 0]],
              "output_layers": [["add_1", 0, 0]]
            },
            "name": "model_1",
            "inbound_nodes": [[["model", 1, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_2",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 38, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_7"
                  },
                  "name": "input_7",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_13",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_13",
                  "inbound_nodes": [[["input_7", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_13",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_13",
                  "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_10",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_10",
                  "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_14",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_14",
                  "inbound_nodes": [[["re_lu_10", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_14",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_14",
                  "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_11",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_11",
                  "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_15",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_15",
                  "inbound_nodes": [[["re_lu_11", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_15",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_15",
                  "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_12",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_12",
                  "inbound_nodes": [[["input_7", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_12",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_12",
                  "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_12",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_12",
                  "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_2",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout_2",
                  "inbound_nodes": [[["re_lu_12", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add_2",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add_2",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_12", 0, 0, {}],
                      ["dropout_2", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_7", 0, 0]],
              "output_layers": [["add_2", 0, 0]]
            },
            "name": "model_2",
            "inbound_nodes": [[["model_1", 1, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_3",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 19, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_8"
                  },
                  "name": "input_8",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_17",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_17",
                  "inbound_nodes": [[["input_8", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_17",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_17",
                  "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_13",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_13",
                  "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_18",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_18",
                  "inbound_nodes": [[["re_lu_13", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_18",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_18",
                  "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_14",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_14",
                  "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_19",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_19",
                  "inbound_nodes": [[["re_lu_14", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
