{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.2.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_46",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 171, 300, 1],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_27"
            },
            "name": "input_27",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_86",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [1, 3],
              "strides": [1, 2],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.009999999776482582 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_86",
            "inbound_nodes": [[["input_27", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_85",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_85",
            "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]
          },
          {
            "class_name": "ReLU",
            "config": {
              "name": "re_lu_65",
              "trainable": true,
              "dtype": "float32",
              "max_value": null,
              "negative_slope": 0.0,
              "threshold": 0.0
            },
            "name": "re_lu_65",
            "inbound_nodes": [[["batch_normalization_85", 0, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_42",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 150, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_28"
                  },
                  "name": "input_28",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_88",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_88",
                  "inbound_nodes": [[["input_28", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_87",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_87",
                  "inbound_nodes": [[["conv2d_88", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_66",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_66",
                  "inbound_nodes": [[["batch_normalization_87", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_89",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_89",
                  "inbound_nodes": [[["re_lu_66", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_88",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_88",
                  "inbound_nodes": [[["conv2d_89", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_67",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_67",
                  "inbound_nodes": [[["batch_normalization_88", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_90",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_90",
                  "inbound_nodes": [[["re_lu_67", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_89",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_89",
                  "inbound_nodes": [[["conv2d_90", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_87",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_87",
                  "inbound_nodes": [[["input_28", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_68",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_68",
                  "inbound_nodes": [[["batch_normalization_89", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_86",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_86",
                  "inbound_nodes": [[["conv2d_87", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_25",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout_25",
                  "inbound_nodes": [[["re_lu_68", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add_20",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add_20",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_86", 0, 0, {}],
                      ["dropout_25", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_28", 0, 0]],
              "output_layers": [["add_20", 0, 0]]
            },
            "name": "model_42",
            "inbound_nodes": [[["re_lu_65", 0, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_43",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 75, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_29"
                  },
                  "name": "input_29",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_92",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_92",
                  "inbound_nodes": [[["input_29", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_91",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_91",
                  "inbound_nodes": [[["conv2d_92", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_69",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_69",
                  "inbound_nodes": [[["batch_normalization_91", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_93",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_93",
                  "inbound_nodes": [[["re_lu_69", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_92",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_92",
                  "inbound_nodes": [[["conv2d_93", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_70",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_70",
                  "inbound_nodes": [[["batch_normalization_92", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_94",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_94",
                  "inbound_nodes": [[["re_lu_70", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_93",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_93",
                  "inbound_nodes": [[["conv2d_94", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_91",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_91",
                  "inbound_nodes": [[["input_29", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_71",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_71",
                  "inbound_nodes": [[["batch_normalization_93", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_90",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_90",
                  "inbound_nodes": [[["conv2d_91", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_26",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout_26",
                  "inbound_nodes": [[["re_lu_71", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add_21",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add_21",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_90", 0, 0, {}],
                      ["dropout_26", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_29", 0, 0]],
              "output_layers": [["add_21", 0, 0]]
            },
            "name": "model_43",
            "inbound_nodes": [[["model_42", 1, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_44",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 38, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_30"
                  },
                  "name": "input_30",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_96",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_96",
                  "inbound_nodes": [[["input_30", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_95",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_95",
                  "inbound_nodes": [[["conv2d_96", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_72",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_72",
                  "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_97",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_97",
                  "inbound_nodes": [[["re_lu_72", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_96",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_96",
                  "inbound_nodes": [[["conv2d_97", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_73",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_73",
                  "inbound_nodes": [[["batch_normalization_96", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_98",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_98",
                  "inbound_nodes": [[["re_lu_73", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_97",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_97",
                  "inbound_nodes": [[["conv2d_98", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_95",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_95",
                  "inbound_nodes": [[["input_30", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_74",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_74",
                  "inbound_nodes": [[["batch_normalization_97", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_94",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_94",
                  "inbound_nodes": [[["conv2d_95", 0, 0, {}]]]
                },
                {
                  "class_name": "Dropout",
                  "config": {
                    "name": "dropout_27",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                  },
                  "name": "dropout_27",
                  "inbound_nodes": [[["re_lu_74", 0, 0, {}]]]
                },
                {
                  "class_name": "Add",
                  "config": {
                    "name": "add_22",
                    "trainable": true,
                    "dtype": "float32"
                  },
                  "name": "add_22",
                  "inbound_nodes": [
                    [
                      ["batch_normalization_94", 0, 0, {}],
                      ["dropout_27", 0, 0, {}]
                    ]
                  ]
                }
              ],
              "input_layers": [["input_30", 0, 0]],
              "output_layers": [["add_22", 0, 0]]
            },
            "name": "model_44",
            "inbound_nodes": [[["model_43", 1, 0, {}]]]
          },
          {
            "class_name": "Functional",
            "config": {
              "name": "model_45",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 171, 19, 256],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_31"
                  },
                  "name": "input_31",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_100",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 2],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": {
                      "class_name": "L1L2",
                      "config": { "l2": 0.009999999776482582 }
                    },
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_100",
                  "inbound_nodes": [[["input_31", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_99",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_99",
                  "inbound_nodes": [[["conv2d_100", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_75",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_75",
                  "inbound_nodes": [[["batch_normalization_99", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_101",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_101",
                  "inbound_nodes": [[["re_lu_75", 0, 0, {}]]]
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "name": "batch_normalization_100",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [3],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": { "class_name": "Zeros", "config": {} },
                    "gamma_initializer": { "class_name": "Ones", "config": {} },
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                  },
                  "name": "batch_normalization_100",
                  "inbound_nodes": [[["conv2d_101", 0, 0, {}]]]
                },
                {
                  "class_name": "ReLU",
                  "config": {
                    "name": "re_lu_76",
                    "trainable": true,
                    "dtype": "float32",
                    "max_value": null,
                    "negative_slope": 0.0,
                    "threshold": 0.0
                  },
                  "name": "re_lu_76",
                  "inbound_nodes": [[["batch_normalization_100", 0, 0, {}]]]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_102",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_size": [1, 3],
                    "strides": [1, 1],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [1, 1],
                    "groups": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": { "seed": null }
                    },
                    "bias_initializer": { "class_name": "Zeros", "config": {} },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_102",
